import * as React from 'react'
import { NextPage } from 'next'
import Head from 'next/head'
import { collect, defaultColorSet } from '../src/app/dataviz'
import { Sankey } from '../src/components/Sankey'

interface IPageProps {
}

const Page: NextPage<IPageProps> = (props) => {
    const data = {
        nodes: [
            {
                id: 'root0',
                label: 'Управленческая модель',
            },
            {
                id: 'root1',
                label: 'Руководство',
            },
            {
                id: 'root2',
                label: 'Управляющий штаб',
            },
            {
                id: 'd1',
                label: 'Взаимодействие с партнерами',
            },
            {
                id: 'd2',
                label: 'Визит-центры и образование',
            },
            {
                id: 'd3',
                label: 'Исследования и охрана окружающей среды',
            },
            {
                id: 'd4',
                label: 'Территориальное управление',
            },
            {
                id: 'd5',
                label: 'Управление потоками посетителей и мониторинг',
            },
            {
                id: 'd6',
                label: 'Административные функции',
            },
            
            {
                id: 'd11',
                label: 'Партнерство с другими Арктическими территориями',
            },
            {
                id: 'd12',
                label: 'Сотрудничество с руководством Республики Якутия (представитель от Республики в составе) департамента)',
            },
            {
                id: 'd13',
                label: 'Сотрудничество со спонсорами и меценатами',
            },
            {
                id: 'd21',
                label: 'Разработка и исполнение событийной программы',
            },
            {
                id: 'd22',
                label: 'Управление визит- центрами',
            },
            {
                id: 'd23',
                label: 'Координация и развитие просветительских программ',
            },
            {
                id: 'd24',
                label: 'Музей краеведения «Полюс холода»',
            },
            {
                id: 'd25',
                label: 'Организация временных выставок',
            },
            {
                id: 'd26',
                label: 'Развитие волонтерских программ',
            },
            {
                id: 'd27',
                label: 'Управление образовательными проектами',
            },
            
            {
                id: 'd31',
                label: 'Исполнение природоохранных мероприятий',
            },
            {
                id: 'd32',
                label: 'Инициирование и реализация исследовательских проектов',
            },
            {
                id: 'd33',
                label: 'Сотрудничество с научным сообществом',
            },
            {
                id: 'd34',
                label: 'Подготовка и публикация научно-исследовательских работ',
            },
            {
                id: 'd35',
                label: 'Организация научно-исследовател мероприятий',
            },
            {
                id: 'd36',
                label: 'Информационное сопровождение работы департамента',
            },

            {
                id: 'd41',
                label: 'Управление земельными ресурсами',
            },
            {
                id: 'd42',
                label: 'Контроль за соблюдением законодательства в области использования Природных ресурсов',
            },
            {
                id: 'd43',
                label: 'Разработка мастер-плана развития кластера',
            },
            {
                id: 'd44',
                label: 'Управление инфраструк турными итехническими объектами',
            },
            
            {
                id: 'd51',
                label: 'Управление потоками посетителей и рекреационной инфраструктурой',
            },
            {
                id: 'd52',
                label: 'Развитие безбарьерной среды',
            },
            {
                id: 'd53',
                label: 'Социально-экономический мониторинг',
            },
            {
                id: 'd54',
                label: 'Мониторинг антропогенной нагрузки',
            },
            {
                id: 'd55',
                label: 'Экологический мониторинг',
            },
            {
                id: 'd56',
                label: 'Внедрение и использование IT- и GIS-технологий',
            },
            {
                id: 'd57',
                label: 'Проверка и контроль деятельности туристических информационных порталов',
            },
            
            {
                id: 'd61',
                label: 'Операционный менеджмент',
            },
            {
                id: 'd62',
                label: 'Управление транспортным сообщением',
            },
            {
                id: 'd63',
                label: 'Управление персоналом',
            },
            {
                id: 'd64',
                label: 'Бюджетирование',
            },
        ],
        links: collect([
            [1, ['root0', 'root1', 'd1', 'd11']],
            [1, ['root0', 'root1', 'd1', 'd12']],
            [1, ['root0', 'root1', 'd1', 'd13']],
            [1, ['root0', 'root1', 'd2', 'd21']],
            [1, ['root0', 'root1', 'd2', 'd22']],
            [1, ['root0', 'root1', 'd2', 'd23']],
            [1, ['root0', 'root1', 'd2', 'd24']],
            [1, ['root0', 'root1', 'd2', 'd25']],
            [1, ['root0', 'root1', 'd2', 'd26']],
            [1, ['root0', 'root1', 'd2', 'd27']],
            [1, ['root0', 'root1', 'd3', 'd31']],
            [1, ['root0', 'root1', 'd3', 'd32']],
            [1, ['root0', 'root1', 'd3', 'd33']],
            [1, ['root0', 'root1', 'd3', 'd34']],
            [1, ['root0', 'root1', 'd3', 'd35']],
            [1, ['root0', 'root1', 'd3', 'd36']],
            [1, ['root0', 'root1', 'd4', 'd41']],
            [1, ['root0', 'root1', 'd4', 'd42']],
            [1, ['root0', 'root1', 'd4', 'd43']],
            [1, ['root0', 'root1', 'd4', 'd44']],
            [1, ['root0', 'root1', 'd5', 'd51']],
            [1, ['root0', 'root1', 'd5', 'd52']],
            [1, ['root0', 'root1', 'd5', 'd53']],
            [1, ['root0', 'root1', 'd5', 'd54']],
            [1, ['root0', 'root1', 'd5', 'd55']],
            [1, ['root0', 'root1', 'd5', 'd56']],
            [1, ['root0', 'root1', 'd5', 'd57']],
            [1, ['root0', 'root1', 'd6', 'd61']],
            [1, ['root0', 'root1', 'd6', 'd62']],
            [1, ['root0', 'root1', 'd6', 'd63']],
            [1, ['root0', 'root1', 'd6', 'd64']],
            [5, ['root0', 'root2']],
        ])
    }

    return (
        <div>
            <style jsx>{`
                div {
                    width: 100%;
                    height: 100vh;
                }
            `}</style>

            <Head>
                <title>Oymyakon Dataviz</title>
            </Head>

            <Sankey
                showLegend={false}
                data={data}
                defaultColorSet={defaultColorSet}
                layout={'vertical'}
                labelLayout={'vertical'}
            />
        </div>
    )
}

export default Page